# ViewGraphSchedMaterialTypes Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewGraphSchedMaterialTypes Property
ParameterTypeId Class See Also
---
"Material Types"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewGraphSchedMaterialTypes { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewGraphSchedMaterialTypes As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewGraphSchedMaterialTypes {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace